---
type: GeometryInstance
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# GeometryInstance

`Autodesk.Revit.DB.GeometryInstance` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDocument | 2023 | `public Document GetDocument ()` |
| Method | GetInstanceGeometry | — | `` |
| Method | GetInstanceGeometry | — | `public GeometryElement GetInstanceGeometry ()` |
| Method | GetSymbolGeometry | — | `` |
| Method | GetSymbolGeometry | — | `public GeometryElement GetSymbolGeometry ()` |
| Method | GetSymbolGeometryId | 2023 | `public SymbolGeometryId GetSymbolGeometryId ()` |
| Property | SymbolGeometry | — | `public GeometryElement SymbolGeometry { get ; }` |
| Property | Transform | — | `public Transform Transform { get ; }` |